app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects`

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `description`) VALUES('', '2010-08-17 12:25:21', '2010-08-17 12:25:21', '')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 4)
UPDATE `projects` SET `updated_at` = '2010-08-18 06:07:23', `description` = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Suspendisse gravida diam vitae lacus scelerisque ut malesuada neque interdum. Pellentesque sapien purus, sollicitudin quis sodales ac, convallis vitae dolor. Pellentesque in arcu enim, vitae aliquam purus. Cras pharetra convallis accumsan. Mauris fermentum orci sit amet tortor dignissim vehicula. Proin vitae nulla vitae felis tristique venenatis. Morbi augue tortor, pretium id malesuada eu, egestas ac diam. Fusce est magna, aliquet in bibendum eu, vulputate at ipsum. Donec imperdiet porttitor velit, eget porta massa porttitor ut. Donec venenatis sapien quis libero suscipit ut sagittis orci imperdiet. Maecenas sed nisi metus. Praesent ornare fermentum massa, nec ultrices dui dapibus at. Donec posuere feugiat purus eu viverra.' WHERE `id` = 4