app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '272dbc1a862b1cdcced0c2fa2d20a9af1b8306e1', '2010-08-17 11:55:42', 'c6c2396a7d51964d903057f1e7a6b19ec0e00165', NULL, '2010-08-17 11:55:42', NULL, 'dennis', 'dennis@gemango.com')

  def index
    @users = User.find(:all)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)